<?php

declare(strict_types = 1);

todo('Неавторизованный пользователь получает корректный статус код');
todo('Авторизованный пользователь получает корректный статус код');
todo('Авторизованный пользователь видит только свои данные');
todo('Ответ приходит в ожидаемом формате');
todo('Структура ответа должна соответствовать ожиданиям API дизайна');
todo('Ответ пагинирован');
todo('Пользователь может подключить в ответ связанные доп. данные');
todo('Пользователь может фильтровать свой запрос для получения специфического ответа');
todo('Пользователь может сортировать результат при передаче порядка сортировки');
